// import 'package:cloud_firestore/cloud_firestore.dart';

// // to upload data in firebase
// Future<void> uploadQuestionsToFirebase() async {
//   for (final sector in data.entries) {
//     uploadQuestionsForAField(sector.key, sector.value);
//   }
// }

// Future<void> uploadQuestionsForAField(String field, dynamic data) async {
//   FirebaseFirestore.instance.collection('QuestionsTest').doc(field).set(data);
// }

// final data = {
//   "วัดใจเเฟน": {
//     "title": "วัดใจเเฟน",
//     "image_url":
//         "https://img-cdn.pixlr.com/image-generator/history/67be23e95d9d447ab1e2b04c/083aff2e-7ee8-4650-8bb5-c6d2eeaaea99/preview.webp",
//     "questions": {
//       "0": {
//         "correctOptionKey": "4",
//         "options": {
//           "1": "ไปทำงานพิเศษ",
//           "2": "ไปเที่ยวกับเพื่อน",
//           "3": "อยู่บ้านแต่ลืมบอก",
//           "4": "ติดร้านชาบู กินจนลืมเวลา",
//         },
//         "questionText": "ถ้าเราหายไปทั้งวันโดยไม่บอกใคร แฟนคิดว่าเราจะไปไหน?",
//       },
//       "1": {
//         "correctOptionKey": "1",
//         "options": {
//           "1": "ใช้เครื่องแฟนโทรเข้าเครื่องตัวเอง แต่ลืมว่าปิดเสียง",
//           "2": "แจ้งความทันที",
//           "3": "ซื้อเครื่องใหม่ไปเลย",
//           "4": "นั่งทำใจ 3 วันก่อนค่อยหา",
//         },
//         "questionText": "ถ้าเราทำโทรศัพท์หาย แฟนคิดว่าเราจะทำยังไง?",
//       },
//       "2": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "ซื้อของขวัญสุดพิเศษ",
//           "2": "ลืมไปเลยว่าวันนี้ต้องเซอร์ไพรส์",
//           "3": "พาไปกินของอร่อย",
//           "4": "เขียนการ์ดหวานๆ ให้",
//         },
//         "questionText": "ถ้าเราจะทำเซอร์ไพรส์ให้แฟน แฟนคิดว่าเราจะทำอะไร?",
//       },
//       "3": {
//         "correctOptionKey": "3",
//         "options": {
//           "1": "หมา",
//           "2": "แมว",
//           "3": "ตัวเงินตัวทอง เพราะทนถึกเหมือนกัน",
//           "4": "ปลาทอง (เพราะลืมทุก 3 วิ เหมือนเรา)",
//         },
//         "questionText":
//             "ถ้าเราต้องเลือกสัตว์เลี้ยงที่เหมาะกับเรา แฟนคิดว่าเราจะเลือกอะไร?",
//       },
//       "4": {
//         "correctOptionKey": "3",
//         "options": {
//           "1": "อินกับเนื้อเรื่องมาก",
//           "2": "พระเอกตาย",
//           "3": "สั่งของออนไลน์มาแล้วเพิ่งเห็นว่ามันลดราคา",
//           "4": "หนังซึ้งแค่ไหนไม่รู้ แต่หาวจนน้ำตาไหล",
//         },
//         "questionText":
//             "ถ้าเรากำลังดูหนังซึ้งๆ แล้วร้องไห้ แฟนคิดว่าเราร้องเพราะอะไร?",
//       },
//       "5": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "กุญแจบ้าน",
//           "2": "ลืมแปรงฟัน แต่มีหมากฝรั่งแก้ขัด",
//           "3": "กระเป๋าสตางค์",
//           "4": "ลืมตัวว่าไปทำงานสาย",
//         },
//         "questionText": "ถ้าเราตื่นสายแล้วรีบออกจากบ้าน แฟนคิดว่าเราจะลืมอะไร?",
//       },
//       "6": {
//         "correctOptionKey": "4",
//         "options": {
//           "1": "น้ำเปล่ากับขนม",
//           "2": "อาหารแช่แข็ง",
//           "3": "ซื้อของเกินงบที่ตั้งไว้เสมอ",
//           "4": "กดเงินแต่ลืมหยิบเงินออกจากตู้",
//         },
//         "questionText": "ถ้าเรากลับจากเซเว่น แฟนคิดว่าเราจะออกมาพร้อมอะไร?",
//       },
//       "7": {
//         "correctOptionKey": "1",
//         "options": {
//           "1": "มือถือแบต 1% แต่ไม่มีที่ชาร์จ",
//           "2": "มีดอเนกประสงค์",
//           "3": "หนังสือเอาตัวรอดบนเกาะ",
//           "4": "บะหมี่กึ่งสำเร็จรูป (แต่ลืมเอาน้ำไป)",
//         },
//         "questionText":
//             "ถ้าเราต้องติดอยู่บนเกาะร้างกับสิ่งเดียว แฟนคิดว่าเราจะเลือกอะไร?",
//       },
//       "8": {
//         "correctOptionKey": "4",
//         "options": {
//           "1": "ทำหน้าไม่รู้ไม่ชี้",
//           "2": "บอกว่าแมวที่บ้านกิน",
//           "3": "ซื้อมาคืนแต่เป็นรสที่แฟนไม่ชอบ",
//           "4": "โทษแรงโน้มถ่วงว่าทำให้มันตกเข้าปาก",
//         },
//         "questionText":
//             "ถ้าเราผิดกินของที่แฟนแอบเก็บไว้ แฟนคิดว่าเราจะทำยังไง?",
//       },
//       "9": {
//         "correctOptionKey": "4",
//         "options": {
//           "1": "ไปเที่ยวรอบโลก",
//           "2": "ฝากเงินเข้าธนาคาร",
//           "3": "ซื้อของขวัญให้แฟนก่อน",
//           "4": "ไปซื้อบัตรเติมเงินก่อน เพราะเน็ตจะหมด",
//         },
//         "questionText":
//             "ถ้าเราถูกล็อตเตอรี่รางวัลที่ 1 แฟนคิดว่าเราจะทำอะไรเป็นอย่างแรก?",
//       },
//     },
//   },

//   "จิตวิทยา": {
//     "title": "จิตวิทยา",
//     "image_url":
//         "https://img-cdn.pixlr.com/image-generator/history/67bcd040652f67ebf01e37d7/5d672bc3-f3eb-4f43-b05e-96dcda1102e9/preview.webp",
//     "questions": {
//       "0": {
//         "correctOptionKey": "3",
//         "options": {
//           "1": "เดินไปทักทายทันที",
//           "2": "แอบนั่งห่างๆ แล้วส่งข้อความถามว่าเป็นไงบ้าง",
//           "3": "หาที่นั่งไกลๆ แล้วมองดูจากระยะไกล",
//           "4": "หลีกเลี่ยงแล้วเดินออกจากร้าน",
//         },
//         "questionText":
//             "ถ้าคุณเดินเข้าไปในร้านกาแฟและเห็นเพื่อนเก่า นั่งอยู่คนเดียว คุณจะทำยังไง?",
//       },
//       "1": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "พามันกลับบ้านไป",
//           "2": "ถ่ายรูปแล้วโพสต์ให้คนอื่นช่วย",
//           "3": "บอกว่า “อย่ามายุ่งกับชีวิตฉัน”",
//           "4": "หยุดดูสักพักแล้วเดินจากไป",
//         },
//         "questionText":
//             "ถ้าคุณเจอหมาอยู่ข้างทาง และมันดูเหมือนจะโดนทิ้ง คุณจะทำอะไร?",
//       },
//       "2": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "ยิ้มแล้วทักทาย",
//           "2": "มองไปที่พื้นเงียบๆ",
//           "3": "พยายามทำการบ้านหรือเช็กโทรศัพท์",
//           "4": "พูดเรื่องบังเอิญเกี่ยวกับลิฟต์",
//         },
//         "questionText": "ถ้าคุณนั่งอยู่ในลิฟต์กับคนแปลกหน้า คุณจะทำยังไง?",
//       },
//       "3": {
//         "correctOptionKey": "1",
//         "options": {
//           "1": "กอดแล้วพูดว่า “คิดถึงมาก!”",
//           "2": "ยิ้มแล้วบอกว่า “นานแล้วนะที่ไม่ได้เจอ”",
//           "3": "ถามว่า “ชีวิตดีหรือยัง?”",
//           "4": "บอกว่า “คิดถึงช่วงเวลาที่ผ่านไป”",
//         },
//         "questionText": "ถ้าคุณพบเพื่อนเก่าที่ไม่ได้เจอกันมานาน คุณจะทำอะไร?",
//       },
//       "4": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "ปลอบใจแล้วพูดให้กำลังใจ",
//           "2": "หาทางหนีโดยบอกว่า “อยากไปหาที่นั่งพัก”",
//           "3": "พูดว่า “ใจเย็นๆ สิ”",
//           "4": "ถามว่า “เป็นอะไรไป?”",
//         },
//         "questionText":
//             "ถ้าคุณไปเที่ยวกับแฟน แล้วแฟนเริ่มหงุดหงิด คุณจะทำยังไง?",
//       },
//       "5": {
//         "correctOptionKey": "3",
//         "options": {
//           "1": "หัวเราะแล้วพูดต่อไป",
//           "2": "ทำเป็นไม่สนใจแล้วเดินไป",
//           "3": "พูดสั้นๆ แล้วขอตัวกลับ",
//           "4": "แกล้งทำท่าเหมือนกำลังจะไปซื้อของ",
//         },
//         "questionText": "ถ้าคุณเจอคนพูดคุยกับคุณในที่สาธารณะ คุณจะทำยังไง?",
//       },
//       "6": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "เดินไปพูดคุย",
//           "2": "ส่งยิ้มและเดินจากไป",
//           "3": "ส่งข้อความไปแสดงความชอบ",
//           "4": "ชวนไปกินข้าว",
//         },
//         "questionText":
//             "ถ้าคุณเจอคนที่ชอบในที่ทำงานและเขากำลังทำอะไรอยู่ คุณจะทำยังไง?",
//       },
//       "7": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "ถามคนแถวนั้น",
//           "2": "เปิดแผนที่มือถือแล้วพยายามหาทางเอง",
//           "3": "บอกว่า “ขี้เกียจแล้วไปบ้านเพื่อนดีกว่า”",
//           "4": "โทรหาคนที่บ้านแล้วบอกให้มาเอา",
//         },
//         "questionText": "ถ้าคุณหาทางไปบ้านเพื่อนแล้วหลงทาง คุณจะทำอะไร?",
//       },
//       "8": {
//         "correctOptionKey": "3",
//         "options": {
//           "1": "คิดหาทางออกใหม่",
//           "2": "ยอมแพ้แล้วขอให้ทุกอย่างมันจบไป",
//           "3": "หาทางหนีด้วยวิธีที่บ้าๆ",
//           "4": "นั่งคิดแล้วรอให้มันหมดไปเอง",
//         },
//         "questionText": "ถ้าคุณอยู่ในสถานการณ์ที่ไม่มีทางออก คุณจะทำยังไง?",
//       },
//       "9": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "ปล่อยผ่านไป",
//           "2": "โต้ตอบกลับทันที",
//           "3": "หาทางทำให้เขาเข้าใจผิด",
//           "4": "บอกว่า “ไม่น่าสนใจเลย”",
//         },
//         "questionText": "ถ้าคุณได้ยินใครพูดถึงคุณไม่ดี คุณจะทำยังไง?",
//       },
//     },
//   },

//   "คำถามทั่วไป": {
//     "title": "คำถามทั่วไป",
//     "image_url":
//         "https://img-cdn.pixlr.com/image-generator/history/67bcde9441230f5630cab13c/67bcde9441230f5630cab138/preview.webp",
//     "questions": {
//       "0": {
//         "correctOptionKey": "3",
//         "options": {
//           "1": "กลับไปแก้คำพูดที่ทำให้เพื่อนเสียใจ",
//           "2": "กลับไปทำอาหารไม่เผ็ด",
//           "3": "กดแล้วนั่งรอดูว่าอะไรจะเกิดขึ้น",
//           "4": "กลับไปดูว่ามีอะไรเกิดขึ้นที่เพื่อนบ้าน",
//         },
//         "questionText":
//             "ถ้าคุณมีปุ่มที่สามารถย้อนเวลากลับไปได้ 10 วินาที คุณจะใช้มันทำอะไร?",
//       },
//       "1": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "หายไปจากการประชุม",
//           "2": "หายไปจากที่ทำงานแล้วไปนอนที่บ้าน",
//           "3": "หายไปในเวลาที่ต้องจ่ายเงิน",
//           "4": "หายไปจากการตัดสินใจที่ยากๆ",
//         },
//         "questionText":
//             "ถ้าคุณมีเทคโนโลยีที่สามารถทำให้คุณหายไปจากทุกที่ที่คุณอยู่ คุณจะทำยังไง?",
//       },
//       "2": {
//         "correctOptionKey": "1",
//         "options": {
//           "1": "หาอะไรเล่นในบ้านและดูหนังทั้งวัน",
//           "2": "ออกไปสำรวจหาของกิน",
//           "3": "เดินไปหาที่ซ่อนตัวเพื่อความปลอดภัย",
//           "4": "นั่งคิดว่า 'ใครจะช่วยบอกว่ามีใครอยู่มั้ย?'",
//         },
//         "questionText": "ถ้าคุณตื่นมาในวันที่โลกนี้ไม่มีคนอยู่เลย คุณจะทำอะไร?",
//       },
//       "3": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "พูดภาษาผิดๆ เพื่อทำให้คนอื่นงง",
//           "2": "พูดอย่างที่รู้แล้วหันไปพูดให้ตัวเองฟัง",
//           "3": "หยุดพูดแล้วกลับไปใช้ภาษาของตัวเอง",
//           "4": "ใช้ภาษากายแล้วเงียบไป",
//         },
//         "questionText":
//             "ถ้าคุณสามารถพูดภาษาทุกภาษาในโลกได้ แต่ไม่มีใครตอบคุณ คุณจะทำยังไง?",
//       },
//       "4": {
//         "correctOptionKey": "3",
//         "options": {
//           "1": "โทรไปหาเพื่อนในอดีต",
//           "2": "โทรไปถามอนาคตเกี่ยวกับลอตเตอรี่",
//           "3": "โทรไปบอกตัวเองว่า 'อย่าโทรหาฉันอีก!'",
//           "4": "โทรไปถามว่าฉันจะต้องทำอะไรตอนนี้",
//         },
//         "questionText":
//             "ถ้าคุณมีโทรศัพท์ที่สามารถโทรไปยังอดีตหรืออนาคต คุณจะโทรไปที่ไหน?",
//       },
//     },
//   },

//   "ฟุตบอล": {
//     "title": "ฟุตบอล",
//     "image_url":
//         "https://publish-p47754-e237306.adobeaemcloud.com/adobe/dynamicmedia/deliver/dm-aid--5caac151-8ab7-4320-80f4-0328f9b4e743/ND_PERFIL_NUEVA_1PC9260.app.webp?preferwebp=true&width=1440",
//     "questions": {
//       "0": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "โรนัลดินโญ",
//           "2": "โรนัลโด้",
//           "3": "คาฟู",
//           "4": "Rivaldo",
//         },
//         "questionText":
//             "ใครคือผู้เล่นที่ทำประตูให้ทีมชาติบราซิลในฟุตบอลโลก 2002 รอบชิงชนะเลิศ?",
//       },
//       "1": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "แมนเชสเตอร์ ยูไนเต็ด",
//           "2": "ลิเวอร์พูล",
//           "3": "อาร์เซนอล",
//           "4": "เชลซี",
//         },
//         "questionText":
//             "ทีมฟุตบอลไหนที่มีชื่อเสียงที่สุดในอังกฤษในช่วงปี 1990?",
//       },
//       "2": {
//         "correctOptionKey": "2",
//         "options": {
//           "1": "ซามูเอล เอโต้",
//           "2": "ลิโอเนล เมสซี่",
//           "3": "คริสเตียโน่ โรนัลโด้",
//           "4": "เดวิด เบ็คแฮม",
//         },
//         "questionText": "ใครคือผู้เล่นที่ได้รับรางวัลลูกบอลทองคำในปี 2009?",
//       },
//       "3": {
//         "correctOptionKey": "1",
//         "options": {
//           "1": "แมนเชสเตอร์ ยูไนเต็ด",
//           "2": "อาร์เซนอล",
//           "3": "เชลซี",
//           "4": "แมนเชสเตอร์ ซิตี้",
//         },
//         "questionText": "สโมสรฟุตบอลไหนที่หลังคาไม่ซ่อม",
//       },
//       "4": {
//         "correctOptionKey": "1",
//         "options": {
//           "1": "การท่าเรือ",
//           "2": "ชลบุรี เอ็ฟซี",
//           "3": "เอซี มิลาน",
//           "4": "บีจี ปทุม",
//         },
//         "questionText":
//             "สโมสรฟุตบอลในอิตาลี่ที่เพิ่งตกรอบ UCL คือสโมสรใด",
//       },
//     },
//   },
// };